#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>




//int main()
//{
//	char a = 20;
//	//
//	//00000000000000000000000000010100
//	//00010100 - a的有效位数(char只有8个bit)
//	char b = 130;
//	//
//	//00000000000000000000000010000010
//	//10000010 - b的有效位数
//	char c = a + b;
//	//整型类运算需要先转换为CPU内整型操作数的标准长度
//	//转换时与变量类型的符号有关，在VS中，char为signed char，即有符号字符
//	//进行整体提升的规则：
//	//1. 有符号整数按照变量的数据类型的符号位进行提升（signed char按最高位补）
//	//2. 无符号整数提升，高位补0
//
//	//00000000000000000000000000010100 - a
//	//11111111111111111111111110000010 - b
//	//11111111111111111111111110010110 - a+b的补码
//	//为了存放到只有8个bit的char变量中，进行截断
//	//10010110 - c
//
//	printf("c=%d\n", c);
//	//把c按照整数打印
//	//先整体提升到32bit：
//	//11111111111111111111111110010110 - c的补码
//	//10000000000000000000000001101001 - c的反码
//	//10000000000000000000000001101010 - c的原码
//	//对应整数：64+32+8+2=-106
//
//	return 0;
//}

int main()
{
	int a = 20;
	//变量创建的本质其实是在内存中申请空间
	//int类整型，会向内存申请4个byte，32个bit的空间
	//这4个byte，每个都有编号（地址）
	//变量的名字仅仅是给程序员看的，编译器不看名字
	printf("%p\n", &a);
	//取地址会取到第一个字节的地址
	// 打印地址使用 %p
	//打印结果：000000ABFD6FF9A4，省略了0x
	int* pa = &a;
	//pa是一个变量，这个变量pa是用来存放地址（指针的），pa叫做指针变量
	//pa是变量名，int * 是pa的类型，表示指向int类型的指针  
	*pa = 114514;
	// * 解引用操作符（间接访问操作符）--->通过地址找到a进行访问或操作
	printf("a = %d", a);

	return 0;
}